In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [5]:
dframe = DataFrame({'city':['Alma','Brian Head', 'Fox Park'],
                   'altitude':[3158,3000,2762]})
dframe

   altitude        city
0      3158        Alma
1      3000  Brian Head
2      2762    Fox Park

In [15]:
state_map = {'Alma': 'Pennsylvania', 'Alma':'Colorado', 'Brian Head':'Utah','Fox Park':'Wyoming'}

In [16]:
dframe['state'] = dframe['city'].map(state_map)

In [17]:
dframe

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2762    Fox Park   Wyoming

In [18]:
dframe

   altitude        city     state
0      3158        Alma  Colorado
1      3000  Brian Head      Utah
2      2762    Fox Park   Wyoming

In [24]:
def first_three_cap(val):
    return str(val)[:3].upper()

In [25]:
dframe['state'].apply(first_three_cap)

0    COL
1    UTA
2    WYO
Name: state, dtype: object

In [28]:
dframe.apply(lambda row: row['city'] + '_' + row['state'], axis=1)

0       Alma_Colorado
1     Brian Head_Utah
2    Fox Park_Wyoming
dtype: object

modality { CR, DX }
views { 1V, 2V }
foreign_body_present { Y, N }

CR_1V_Y 100
CR_2V_Y  20
CR_2V_N 300
DX_2V_Y  10